# завдання 2. я не впевнена що завдання виконане правильно. цикл йде по такому алгоритму: виводить I love Python та строку вводу (input),
# чекає ввод від користувача, поки вводу немає цикл не рухається далі,
# післе вводу (enter) минає 4.2 секунди і знову друкується I love Python та строку вводу(input) і так далі поки не ввести exit


import time

while True:
    print("I love Python")
    if input("stop word: ") != "exit":
        time.sleep(4.2)
    else:
        print("completed")
        break


# я перебрала багато варіантів, але не змогла придумати, як не стопоритися на input
# я так розумію, що input в любому випадку чекатиме ввод даних від користувача і поки  дані не введуться - код не рухається далі
